pruebas/guion_sii_emitidas2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd"
xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd">
<soapenv:Header/>
   <soapenv:Body>
      <siiLR:SuministroLRFacturasEmitidas>
         <sii:Cabecera>
            <sii:IDVersionSii>1.1</sii:IDVersionSii>
            <sii:Titular>
               <sii:NombreRazon>DIAGRAM SOFTWARE, S.L.</sii:NombreRazon>
               <sii:NIF>B53179768</sii:NIF>
            </sii:Titular>
            <sii:TipoComunicacion>A0</sii:TipoComunicacion>
         </sii:Cabecera>
         <siiLR:RegistroLRFacturasEmitidas>
            <sii:PeriodoLiquidacion>
               <sii:Ejercicio>2018</sii:Ejercicio>
               <sii:Periodo>07</sii:Periodo>
            </sii:PeriodoLiquidacion>
            <siiLR:IDFactura>
               <sii:IDEmisorFactura>
                  <sii:NIF>B53179768</sii:NIF>
               </sii:IDEmisorFactura>
               <sii:NumSerieFacturaEmisor>668</sii:NumSerieFacturaEmisor>
               <sii:FechaExpedicionFacturaEmisor>01-07-2018</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaExpedida>
               <sii:TipoFactura>F1</sii:TipoFactura>
               <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
               <sii:ImporteTotal>4840</sii:ImporteTotal>
               <sii:DescripcionOperacion>VENTAS</sii:DescripcionOperacion>
               <sii:RefExterna>FACTURA DEL GAS HASTA EL MAXIMO DE CAPACIDAD DEL CAMPO QUE N</sii:RefExterna>
               <sii:FacturacionDispAdicionalTerceraYsextayDelMercadoOrganizadoDelGas>S</sii:FacturacionDispAdicionalTerceraYsextayDelMercadoOrganizadoDelGas>
               <sii:Contraparte>
                  <sii:NombreRazon>ALBAPROA S.L.</sii:NombreRazon>
                  <sii:NIF>B02028702</sii:NIF>
               </sii:Contraparte>
               <sii:TipoDesglose>
                  <sii:DesgloseFactura>
                     <sii:Sujeta>
                        <sii:NoExenta>
                           <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                           <sii:DesgloseIVA>
                              <sii:DetalleIVA>
                                 <sii:TipoImpositivo>21</sii:TipoImpositivo>
                                 <sii:BaseImponible>4000</sii:BaseImponible>
                                 <sii:CuotaRepercutida>840</sii:CuotaRepercutida>
                              </sii:DetalleIVA>
                           </sii:DesgloseIVA>
                        </sii:NoExenta>
                     </sii:Sujeta>
                  </sii:DesgloseFactura>
               </sii:TipoDesglose>
            </siiLR:FacturaExpedida>
         </siiLR:RegistroLRFacturasEmitidas>
         <siiLR:RegistroLRFacturasEmitidas>
            <sii:PeriodoLiquidacion>
               <sii:Ejercicio>2018</sii:Ejercicio>
               <sii:Periodo>07</sii:Periodo>
            </sii:PeriodoLiquidacion>
            <siiLR:IDFactura>
               <sii:IDEmisorFactura>
                  <sii:NIF>B53179768</sii:NIF>
               </sii:IDEmisorFactura>
               <sii:NumSerieFacturaEmisor>47</sii:NumSerieFacturaEmisor>
               <sii:FechaExpedicionFacturaEmisor>01-07-2018</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaExpedida>
               <sii:TipoFactura>F1</sii:TipoFactura>
               <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
               <sii:ImporteTotal>1194.27</sii:ImporteTotal>
               <sii:DescripcionOperacion>VENTAS</sii:DescripcionOperacion>
               <sii:RefExterna>DIFICULTAD ENVIO</sii:RefExterna>
               <sii:RegPrevioGGEEoREDEMEoCompetencia>S</sii:RegPrevioGGEEoREDEMEoCompetencia>
               <sii:Contraparte>
                  <sii:NombreRazon>ALBAPROA S.L.</sii:NombreRazon>
                  <sii:NIF>B02028702</sii:NIF>
               </sii:Contraparte>
               <sii:TipoDesglose>
                  <sii:DesgloseFactura>
                     <sii:Sujeta>
                        <sii:NoExenta>
                           <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                           <sii:DesgloseIVA>
                              <sii:DetalleIVA>
                                 <sii:TipoImpositivo>21</sii:TipoImpositivo>
                                 <sii:BaseImponible>987</sii:BaseImponible>
                                 <sii:CuotaRepercutida>207.27</sii:CuotaRepercutida>
                              </sii:DetalleIVA>
                           </sii:DesgloseIVA>
                        </sii:NoExenta>
                     </sii:Sujeta>
                  </sii:DesgloseFactura>
               </sii:TipoDesglose>
            </siiLR:FacturaExpedida>
         </siiLR:RegistroLRFacturasEmitidas>
         <siiLR:RegistroLRFacturasEmitidas>
            <sii:PeriodoLiquidacion>
               <sii:Ejercicio>2018</sii:Ejercicio>
               <sii:Periodo>07</sii:Periodo>
            </sii:PeriodoLiquidacion>
            <siiLR:IDFactura>
               <sii:IDEmisorFactura>
                  <sii:NIF>B53179768</sii:NIF>
               </sii:IDEmisorFactura>
               <sii:NumSerieFacturaEmisor>A2 1</sii:NumSerieFacturaEmisor>
               <sii:FechaExpedicionFacturaEmisor>01-07-2018</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaExpedida>
               <sii:TipoFactura>F1</sii:TipoFactura>
               <sii:ClaveRegimenEspecialOTrascendencia>07</sii:ClaveRegimenEspecialOTrascendencia>
               <sii:ImporteTotal>66.55</sii:ImporteTotal>
               <sii:DescripcionOperacion>N/FRA.</sii:DescripcionOperacion>
               <sii:RefExterna>REFERENCIA EXTERNA</sii:RefExterna>
               <sii:Contraparte>
                  <sii:NombreRazon>APELLIDO APELLIDO, NOMBRE</sii:NombreRazon>
                  <sii:NIF>05100001G</sii:NIF>
               </sii:Contraparte>
               <sii:TipoDesglose>
                  <sii:DesgloseFactura>
                     <sii:Sujeta>
                        <sii:NoExenta>
                           <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                           <sii:DesgloseIVA>
                              <sii:DetalleIVA>
                                 <sii:TipoImpositivo>21</sii:TipoImpositivo>
                                 <sii:BaseImponible>55</sii:BaseImponible>
                                 <sii:CuotaRepercutida>11.55</sii:CuotaRepercutida>
                              </sii:DetalleIVA>
                           </sii:DesgloseIVA>
                        </sii:NoExenta>
                     </sii:Sujeta>
                  </sii:DesgloseFactura>
               </sii:TipoDesglose>
            </siiLR:FacturaExpedida>
         </siiLR:RegistroLRFacturasEmitidas>
         <siiLR:RegistroLRFacturasEmitidas>
            <sii:PeriodoLiquidacion>
               <sii:Ejercicio>2018</sii:Ejercicio>
               <sii:Periodo>07</sii:Periodo>
            </sii:PeriodoLiquidacion>
            <siiLR:IDFactura>
               <sii:IDEmisorFactura>
                  <sii:NIF>B53179768</sii:NIF>
               </sii:IDEmisorFactura>
               <sii:NumSerieFacturaEmisor>S18 1</sii:NumSerieFacturaEmisor>
               <sii:FechaExpedicionFacturaEmisor>01-07-2018</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaExpedida>
               <sii:TipoFactura>F1</sii:TipoFactura>
               <sii:ClaveRegimenEspecialOTrascendencia>01</sii:ClaveRegimenEspecialOTrascendencia>
               <sii:ImporteTotal>484</sii:ImporteTotal>
               <sii:DescripcionOperacion>N/FRA. FACT.SIMPLIFICADA</sii:DescripcionOperacion>
               <sii:RefExterna>SIMPLIFICADA Y SUCEDIDA</sii:RefExterna>
               <sii:FacturaSimplificadaArticulos7.2_7.3>S</sii:FacturaSimplificadaArticulos7.2_7.3>
               <sii:EntidadSucedida>
                  <sii:NombreRazon>ALBAPROA S.L.</sii:NombreRazon>
                  <sii:NIF>B02028702</sii:NIF>
               </sii:EntidadSucedida>
               <sii:Contraparte>
                  <sii:NombreRazon>APELLIDO APELLIDO, NOMBRE</sii:NombreRazon>
                  <sii:NIF>05100001G</sii:NIF>
               </sii:Contraparte>
               <sii:TipoDesglose>
                  <sii:DesgloseFactura>
                     <sii:Sujeta>
                        <sii:NoExenta>
                           <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                           <sii:DesgloseIVA>
                              <sii:DetalleIVA>
                                 <sii:TipoImpositivo>21</sii:TipoImpositivo>
                                 <sii:BaseImponible>400</sii:BaseImponible>
                                 <sii:CuotaRepercutida>84</sii:CuotaRepercutida>
                              </sii:DetalleIVA>
                           </sii:DesgloseIVA>
                        </sii:NoExenta>
                     </sii:Sujeta>
                  </sii:DesgloseFactura>
               </sii:TipoDesglose>
            </siiLR:FacturaExpedida>
         </siiLR:RegistroLRFacturasEmitidas>
         <siiLR:RegistroLRFacturasEmitidas>
            <sii:PeriodoLiquidacion>
               <sii:Ejercicio>2018</sii:Ejercicio>
               <sii:Periodo>07</sii:Periodo>
            </sii:PeriodoLiquidacion>
            <siiLR:IDFactura>
               <sii:IDEmisorFactura>
                  <sii:NIF>B53179768</sii:NIF>
               </sii:IDEmisorFactura>
               <sii:NumSerieFacturaEmisor>6668/18</sii:NumSerieFacturaEmisor>
               <sii:FechaExpedicionFacturaEmisor>01-07-2018</sii:FechaExpedicionFacturaEmisor>
            </siiLR:IDFactura>
            <siiLR:FacturaExpedida>
               <sii:TipoFactura>F1</sii:TipoFactura>
               <sii:ClaveRegimenEspecialOTrascendencia>12</sii:ClaveRegimenEspecialOTrascendencia>
               <sii:ImporteTotal>1210</sii:ImporteTotal>
               <sii:DescripcionOperacion>alquileres</sii:DescripcionOperacion>
               <sii:DatosInmueble>
                  <sii:DetalleInmueble>
                     <sii:SituacionInmueble>1</sii:SituacionInmueble>
                     <sii:ReferenciaCatastral>12345678901234567890</sii:ReferenciaCatastral>
                  </sii:DetalleInmueble>
               </sii:DatosInmueble>
               <sii:Contraparte>
                  <sii:NombreRazon>APELLIDO APELLIDO, NOMBRE</sii:NombreRazon>
                  <sii:NIF>05100001G</sii:NIF>
               </sii:Contraparte>
               <sii:TipoDesglose>
                  <sii:DesgloseFactura>
                     <sii:Sujeta>
                        <sii:NoExenta>
                           <sii:TipoNoExenta>S1</sii:TipoNoExenta>
                           <sii:DesgloseIVA>
                              <sii:DetalleIVA>
                                 <sii:TipoImpositivo>21</sii:TipoImpositivo>
                                 <sii:BaseImponible>1000</sii:BaseImponible>
                                 <sii:CuotaRepercutida>210</sii:CuotaRepercutida>
                              </sii:DetalleIVA>
                           </sii:DesgloseIVA>
                        </sii:NoExenta>
                     </sii:Sujeta>
                  </sii:DesgloseFactura>
               </sii:TipoDesglose>
            </siiLR:FacturaExpedida>
         </siiLR:RegistroLRFacturasEmitidas>
      </siiLR:SuministroLRFacturasEmitidas>
   </soapenv:Body>
</soapenv:Envelope>
